---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.WrongConstraintInTrussSketch
source: html/4ecb6e50-47d1-f834-efb6-ff18438b3386.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.WrongConstraintInTrussSketch Property

Structural Truss sketch can't be constrained to its members.

## Syntax (C#)
```csharp
public static FailureDefinitionId WrongConstraintInTrussSketch { get; }
```